guitarhua/ezos/components/cpn_uip/chips/stm32_eth_uip.c
/**
  ******************************************************************************
  * @file    stm32_eth.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    06/19/2009
  * @brief   This file provides all the ETH firmware functions.
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2009 STMicroelectronics</center></h2>
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_eth_uip.h"
#include "misc.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"



#ifdef STM32_ETH_UIP_ENABLE
/**
  ******************************************************************************
  * -V1.0.0, 2013.1.11, mousie
  *          - 属于STM32F105/STM32F107 网络底层硬件驱动配置.
  *          - 支持 MII / RMII 数据接口, 二选一.
  *          - 可选择是否使用 MCO 口. 即通过STM32芯片引脚给提供CLK信号.
  *          - 此驱动用于支持 uIP 组件. 请勿直接调用.
  *          - 硬件上, 需要通过 MII 或 RMII 接口, 外接物理层芯片 DP83848.
  ******************************************************************************
  */
#define STM32_ETH_PRINTF(...)           assert_printf(__VA_ARGS__)

#define PHY_ADDRESS                     0x01                                    // 物理层芯片(DP83848)地址
#define ETH_RXBUFNB                     2                                       // 接收缓冲区帧数
#define ETH_TXBUFNB                     2                                       // 发送缓冲区帧数



/* Ethernet Rx & Tx DMA Descriptors */
ETH_DMADESCTypeDef  DMARxDscrTab[ETH_RXBUFNB], DMATxDscrTab[ETH_TXBUFNB];
/* Ethernet buffers */
u8 Rx_Buff[ETH_RXBUFNB][ETH_MAX_PACKET_SIZE], Tx_Buff[ETH_TXBUFNB][ETH_MAX_PACKET_SIZE];



// STM32 网络接口 GPIO 配置
void GPIO_Configuration(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Enable GPIOs clocks */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC, ENABLE);

#ifdef ETH_PIN_REMAP_ENABLE
    // 使能网络引脚重映射功能
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO, ENABLE);
    GPIO_PinRemapConfig(GPIO_Remap_ETH, ENABLE);
#endif

#ifdef ETH_MII_MODE
    // MII模式
    GPIO_ETH_MediaInterfaceConfig(GPIO_ETH_MediaInterface_MII);
    // 使用MCO引脚
    #ifdef ETH_MCO_ENABLE
        /* Get HSE clock = 25MHz on PA8 pin(MCO) */
        RCC_MCOConfig(RCC_MCO_HSE);
    #endif
#elif defined ETH_RMII_MODE
    // RMII模式
    GPIO_ETH_MediaInterfaceConfig(GPIO_ETH_MediaInterface_RMII);
    // 使用MCO引脚
    #ifdef ETH_MCO_ENABLE
        /* Get HSE clock = 25MHz on PA8 pin(MCO) */
        /* set PLL3 clock output to 50MHz (25MHz /5 *10 =50MHz) */
        RCC_PLL3Config(RCC_PLL3Mul_10);
        /* Enable PLL3 */
        RCC_PLL3Cmd(ENABLE);
        /* Wait till PLL3 is ready */
        while (RCC_GetFlagStatus(RCC_FLAG_PLL3RDY) == RESET) {;}
        /* Get clock PLL3 clock on PA8 pin */
        RCC_MCOConfig(RCC_MCO_PLL3CLK);
    #endif // ETH_MCO_ENABLE
#endif // ETH_MII_MODE

    /* ETHERNET pins configuration */
    /* AF Output Push Pull:
    - ETH_MII_CRS_WKUP:                     PA0
    - ETH_MII_RX_CLK    / ETH_RMII_REF_CLK: PA1
    - ETH_MII_MDIO      / ETH_RMII_MDIO:    PA2
    - ETH_MII_COL:                          PA3
    - ETH_MII_PPS_OUT   / ETH_RMII_PPS_OUT: PB5
    - ETH_MII_TXD3:                         PB8
    - ETH_MII_RX_ER:                        PB10
    - ETH_MII_TX_EN     / ETH_RMII_TX_EN:   PB11
    - ETH_MII_TXD0      / ETH_RMII_TXD0:    PB12
    - ETH_MII_TXD1      / ETH_RMII_TXD1:    PB13
    - ETH_MII_MDC       / ETH_RMII_MDC:     PC1
    - ETH_MII_TXD2:                         PC2
    - ETH_MII_TX_CLK:                       PC3
    - ETH_MII_RX_DV     / ETH_RMII_CRS_DV:  PA7 (or remap to PD8)
    - ETH_MII_RXD0      / ETH_RMII_RXD0:    PC4 (or remap to PD9)
    - ETH_MII_RXD1      / ETH_RMII_RXD1:    PC5 (or remap to PD10)
    - ETH_MII_RXD2:                         PB0 (or remap to PD11)
    - ETH_MII_RXD3:                         PB1 (or remap to PD12) */

    // RMII模式引脚初始化
    // ETH_MII_RX_CLK / ETH_RMII_REF_CLK
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_1;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    // ETH_MII_MDIO / ETH_RMII_MDIO
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

#ifdef ETH_PTP_ENABLE
    // ETH_MII_PPS_OUT / ETH_RMII_PPS_OUT
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_5;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif // ETH_PTP_ENABLE

    // ETH_MII_TX_EN / ETH_RMII_TX_EN
    // ETH_MII_TXD0 / ETH_RMII_TXD0
    // ETH_MII_TXD1 / ETH_RMII_TXD1
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    // ETH_MII_MDC / ETH_RMII_MDC
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_1;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    // ETH_MII_RX_DV / ETH_RMII_CRS_DV
    // ETH_MII_RXD0 / ETH_RMII_RXD0
    // ETH_MII_RXD1 / ETH_RMII_RXD1
#ifdef ETH_PIN_REMAP_ENABLE
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOD, &GPIO_InitStructure);
#else
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_7;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_4 | GPIO_Pin_5;
    GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif // ETH_PIN_REMAP_ENABLE

#ifdef ETH_MII_MODE
    // ETH_MII_CRS_WKUP
    // ETH_MII_COL
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_0 | GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

