guitarhua/ezos/components/cpn_uip/chips/stm32_eth_uip.c
    // ETH_MII_TXD3
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_8;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    // ETH_MII_RX_ER
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    // ETH_MII_TXD2
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    // ETH_MII_TX_CLK
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    // ETH_MII_RXD2:                         PB0 (or remap to PD11)
    // ETH_MII_RXD3:                         PB1 (or remap to PD12)
#ifdef ETH_PIN_REMAP_ENABLE
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_11 | GPIO_Pin_12;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOD, &GPIO_InitStructure);
#else
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_0 | GPIO_Pin_1;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif // ETH_PIN_REMAP_ENABLE
#endif // ETH_MII_MODE

#ifdef ETH_MCO_ENABLE
    // MCO
    GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_8;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif // ETH_MCO_ENABLE
}

// stm32 网络接口初始化函数
void stm32_eth_init(uip_macaddr_t mac)
{
#if !UIP_TASK_RX_SCAN_MS
    NVIC_InitTypeDef NVIC_InitStructure;
#endif
    ETH_InitTypeDef ETH_InitStructure;

    /* Enable ETHERNET clock  */
    RCC_AHBPeriphClockCmd(  RCC_AHBPeriph_ETH_MAC | RCC_AHBPeriph_ETH_MAC_Tx |
                            RCC_AHBPeriph_ETH_MAC_Rx, ENABLE);

    /* Configure the GPIO ports */
    GPIO_Configuration();

#if !UIP_TASK_RX_SCAN_MS
    /* Enable the ETH Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = ETH_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = (ETH_IRQ_PRIORITY & 0x0C) >> 2;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = (ETH_IRQ_PRIORITY & 0x03);
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
#endif

    /* Reset ETHERNET on AHB Bus */
    ETH_DeInit();
    /* Software reset */
    ETH_SoftwareReset();
    /* Wait for software reset */
    while(ETH_GetSoftwareResetStatus()==SET);

    /* ETHERNET Configuration ------------------------------------------------------*/
    /* Call ETH_StructInit if you don't like to configure all ETH_InitStructure parameter */
    ETH_StructInit(&ETH_InitStructure);

    /* Fill ETH_InitStructure parametrs */
    /*------------------------   MAC   -----------------------------------*/
    // 自适应网络模式和速率
    ETH_InitStructure.ETH_AutoNegotiation = ETH_AutoNegotiation_Enable;

    // 非自适应时, 手动配置工作模式, 全双工模式, 否则为半双工模式
    //ETH_InitStructure.ETH_Mode = ETH_Mode_FullDuplex;

    // 非自适应时, 手动配置网络速率, 100M, 否则为10M网速
    //ETH_InitStructure.ETH_Speed = ETH_Speed_100M;

    // 是否接收所有的网络帧, 不启用MAC过滤.
    //ETH_InitStructure.ETH_ReceiveAll = ETH_ReceiveAll_Enable;

    // 是否接收广播帧.
    ETH_InitStructure.ETH_BroadcastFramesReception = ETH_BroadcastFramesReception_Enable;

    // 硬件检查CRC校验
    ETH_InitStructure.ETH_ChecksumOffload = ETH_ChecksumOffload_Enable;

    /*------------------------   DMA   -----------------------------------*/
    /* When we use the Checksum offload feature, we need to enable the Store and Forward mode:
    the store and forward guarantee that a whole frame is stored in the FIFO, so the MAC can insert/verify the checksum,
    if the checksum is OK the DMA can handle the frame otherwise the frame is dropped */
    //ETH_InitStructure.ETH_SecondFrameOperate = ETH_SecondFrameOperate_Enable;
    //ETH_InitStructure.ETH_FixedBurst = ETH_FixedBurst_Enable;
    //ETH_InitStructure.ETH_RxDMABurstLength = ETH_RxDMABurstLength_32Beat;
    //ETH_InitStructure.ETH_TxDMABurstLength = ETH_TxDMABurstLength_32Beat;
    //ETH_InitStructure.ETH_DMAArbitration = ETH_DMAArbitration_RoundRobin_RxTx_2_1;

    /* Configure ETHERNET */
    ETH_Init(&ETH_InitStructure, PHY_ADDRESS);

    /* Enable DMA Receive interrupt (need to enable in this case Normal interrupt) */
    ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_R, ENABLE);

    /* Initialize Tx Descriptors list: Chain Mode */
    ETH_DMATxDescChainInit(DMATxDscrTab, &Tx_Buff[0][0], ETH_TXBUFNB);
    /* Initialize Rx Descriptors list: Chain Mode  */
    ETH_DMARxDescChainInit(DMARxDscrTab, &Rx_Buff[0][0], ETH_RXBUFNB);
    /* MAC address configuration */
    ETH_MACAddressConfig(ETH_MAC_Address0, (u8*)&mac.addr[0]);

    /* Enable MAC and DMA transmission and reception */
    ETH_Start();
}

// stm32检查网络连接状态. 0-未连接, 1-已连接.
uint8_t stm32_eth_linked(void)
{
    uint16_t reg = ETH_ReadPHYRegister(PHY_ADDRESS, PHY_BSR);

    // 1, on. 0, off
    if (reg & PHY_Linked_Status) return 1;
    else                         return 0;
}

#if !UIP_TASK_RX_SCAN_MS
// STM32 中断处理函数
extern void uip_chip_irq_rx(void);
void ETH_IRQHandler(void)
{
    // 接收到数据
    if ((ETH->DMASR & ETH_DMA_FLAG_R) != (u32)RESET )
    {
        uip_chip_irq_rx();
    }

    // 清中断标记
    ETH_DMAClearITPendingBit(ETH_DMA_IT_R);
    ETH_DMAClearITPendingBit(ETH_DMA_IT_NIS);
}
#endif



/** @addtogroup STM32_ETH_Driver
  * @brief ETH driver modules
  * @{
  */

/** @defgroup ETH_Private_TypesDefinitions
  * @{
  */
/**
  * @}
  */


/** @defgroup ETH_Private_Defines
  * @{
  */
/* Global pointers on Tx and Rx descriptor used to track transmit and receive descriptors */
ETH_DMADESCTypeDef  *DMATxDescToSet;
ETH_DMADESCTypeDef  *DMARxDescToGet;
ETH_DMADESCTypeDef  *DMAPTPTxDescToSet;
ETH_DMADESCTypeDef  *DMAPTPRxDescToGet;

